# # 191
data = [
    [ 2000 , 3050 , 2050 , 1980 ] ,
    [ 7500 , 2050 , 2050 , 1980 ] ,
    [ 15450 , 15050 , 15550 , 14900 ]
]
for 행 in data :
    for 열 in 행 :
        print( 열 * 1.00014 )
# 문제 192
data = [
    [ 2000 , 3050 , 2050 , 1980 ] ,
    [ 7500 , 2050 , 2050 , 1980 ] ,
    [ 15450 , 15050 , 15550 , 14900 ]
]
for 행 in data :
    for 열 in 행 :
        print( 열 * 1.00014 )
    print("-------")
# 문제 193
data = [
    [ 2000 , 3050 , 2050 , 1980 ] ,
    [ 7500 , 2050 , 2050 , 1980 ] ,
    [ 15450 , 15050 , 15550 , 14900 ]
]
sonic = [ ]
for 행 in data :
    for 열 in 행 :
        sonic.append( 열 * 1.00014 )
print( sonic )
# 문제 194
data = [
    [ 2000 , 3050 , 2050 , 1980 ] ,
    [ 7500 , 2050 , 2050 , 1980 ] ,
    [ 15450 , 15050 , 15550 , 14900 ]
]
결과 = [ ]
for 행 in data :
    sonic = [ ]
    for 열 in 행 :
        sonic.append( 열 * 1.00014 )
    결과.append(sonic)
print( 결과 )
# 문제 195
oh1c = [ [ "open" , "high" , "low", "close" ] ,
         [ 100 , 110 , 70 , 100 ] ,
         [ 200 , 210 , 180 , 190 ] ,
         [ 300 , 310 , 300 , 310 ]
         ]
for 행 in oh1c[ 1 : ] :
    print( 행[3] )
# 문제 196
oh1c = [ [ "open" , "high" , "low", "close" ] ,
         [ 100 , 110 , 70 , 100 ] ,
         [ 200 , 210 , 180 , 190 ] ,
         [ 300 , 310 , 300 , 310 ]
         ]
for 행 in oh1c[ 1 : ] :
    if 행[3] >= 150 :
        print( 행[3] )
# 문제 197
oh1c = [ [ "open" , "high" , "low", "close" ] ,
         [ 100 , 110 , 70 , 100 ] ,
         [ 200 , 210 , 180 , 190 ] ,
         [ 300 , 310 , 300 , 310 ]
         ]
for 행 in oh1c[ 1 : : 2] :
    print( 행[3] )
# 문제 198
oh1c = [ [ "open" , "high" , "low", "close" ] ,
         [ 100 , 110 , 70 , 100 ] ,
         [ 200 , 210 , 180 , 190 ] ,
         [ 300 , 310 , 300 , 310 ]
         ]
변동폭 = []
for 행 in oh1c[ 1 : ] :
    변동폭.append( 행[1] - 행[2] )
print( 변동폭 )
# 문제 199
oh1c = [ [ "open" , "high" , "low", "close" ] ,
         [ 100 , 110 , 70 , 100 ] ,
         [ 200 , 210 , 180 , 190 ] ,
         [ 300 , 310 , 300 , 310 ]
         ]
for 행 in oh1c[ 1 : ] :
    if 행[3] > 행[0] :
        print( 행[1] - 행[2] )
# 문제 200
총수익금 = 0
for 행 in oh1c[ 1 : ] :
    총수익금 += ( 행[3] - 행[0] )
print(총수익금)