# 1.print() 함수
# 정의 : 표준 출력을 하는 함수
# 사용방법 : print("answk)
# 스트림을 강제적으로 flush할지를 지정할때는 flush를 기술합니다.(기본값 : False)
# 2. int() str() fioat() 함수
# 정의 : 숫자로 변환 , 문자로 변환 , 실수로 변환
# 사용방법 :int("문자") , str("숫자") , float("실수")
# 3. 인덱싱이란
# 인덱싱이란 무엇인가를 '가르킨다'는 의미
# 4. 슬라이싱
# 정의 : 슬라이싱은 무엇인가를 '잘라낸다' 라는 의미
# 사용방법 : a[시작번호:끝 번호] 에서 끝 번호 부분을 생략하면 시작 번호부터 그 문자열의 끝까지 뽑아낸다.
# 5.replace() 함수
# 정의 : replace는 문자열을 변경하는 함수이다. 문자열 안에서 특정 문자를 새로운 문자로 변경하는 기능을 가지고 있다
# 사용방법 : replace("-" , " ")
# 6.split() 함수
# 정의 : split 자르다 분리 함수
# 사용방법 : split(" ")
# 7. formatting이란
#포맷이란 데이터를 위해 미리 설정되는 레이아웃으로서, 우리말로는 '형식'이라는 용어와 동일하게 쓰인다.
# 8. format() 함수
# 정의 : 형식, 서식, 초기화, 체제, 형 등의 뜻을 가지고 있다.
# 사용방법 : # {}안에 들어갈 데이터를 farmat 함수 안에 넣기
# 9.f-string
# 정의 : f 문자열 포맷팅
# 사용방법 :  f"문자{변수명}
# 10.strip() 함수
# 정의 :공백을제거하는 함수
# 사용방법 : strip( )
# 11.upper
# 정의 : upper 소문자를 대문자로 벼화주는 함수
# 사용방법 : 땡떙.upper()
# 12.lower
# 정의 : lower 대문자를 소문자로 벼화주는 함수
# 사용방법 : 땡떙.lower()
# 13.capitalize() 함수
# 정의 : 첮글자만 대문자로 변환 해주는 함수
# 사용방법 : 땡떙.capitalize()
# 14. endswith() 함수
# 정의 : 끝나는 문자가 맞는지 확인 함수
# 사용방법 : 땡땡. endswith(끝에있는 말)
# 15. startwith() 함수
# 정의 : 시작하는 문자가 맞는지 확인
# 사용방법 : 땡땡. startswith(처음에있는 말)
# 16. rsplit
# 정의 : 오른쪽 공백 제거
# 사용방법 : 땡땡.rsplit()
# 17.lsplit
# 정의 : 왼쪽 공백 제거
# 사용방법 : 땡땡.lsplit()
# 18.변수와 리스트의 차이
# 변수는 하나를 저장한믄 공간
# 리스트는 여러개를 저장하는 공간
# 리스트는 대괄호
# 19.append() insert()
# 정의 : 리스트에 변수를 추가하는 함수,리스트 가운데에 변수를 추가하는 함수
# 사용방법 : 떙떙.append(),떙떙.insert( 숫자 , 떙떙 )
# 20. del
# 정의 : 삭제
# 사용방법 : del 떙떙[숫자]
# min() max() sum() len() 함수
# 정의 : 최소 , 최고 , 리스트내 숫자를 다 합침 , 리스트내 숫자의 수
# 사용방법 : (min()) , (max()) (sum()) (len())